In [1]:
import pandas as pd
import sqlalchemy as sa

In [2]:
db_secret = {
    'drivername': 'postgresql+psycopg2',
    'host'      : 'mmai5100postgres.canadacentral.cloudapp.azure.com',
    'port'      : '5432',
    'user'      : 'annwang',
    'password'  : '2023!Schulich',
    'database'  : 'mban_db'
}

In [3]:
db_connection_ulr = sa.engine.URL.create(
    drivername = db_secret['drivername'],
    username = db_secret['user'],
    password = db_secret['password'],
    host = db_secret['host'],
    port = db_secret['port'],
    database = db_secret['database']
)

In [4]:
db_secret['host']

'mmai5100postgres.canadacentral.cloudapp.azure.com'

In [5]:
db_connection_ulr

postgresql+psycopg2://annwang:***@mmai5100postgres.canadacentral.cloudapp.azure.com:5432/mban_db

In [6]:
### CRreate an Engine, to automatically close when not using

In [7]:
engine = sa.create_engine(db_connection_ulr)

##Read data using pandas

In [8]:
with engine.connect() as connection:
    data = pd.read_sql(sql='SELECT * FROM dimensions.customer_dimension;', con=connection)

In [9]:
data

,sk_customer,customer_id,first_name,last_name,email,birthdate
0,1064,111,Marge,Simpson,marge.simpson@springfield.com,1956-03-19
1,2027,222,Homer,Simpson,homer.simpson@springfield.com,1956-05-12
2,4242,444,Lisa,Simpson,lisa.simpson@springfield.com,1982-05-09
3,5432,555,Maggie,Simpson,maggie.simpson@springfield.com,1989-01-14
4,3666,333,Bart,Simpson,bart.simpson@springfield.com,1980-02-23

In [10]:
### create connection

In [11]:
    data = pd.read_sql(sql='SELECT * FROM dimensions.customer_dimension;', con=engine)

In [12]:
data

,sk_customer,customer_id,first_name,last_name,email,birthdate
0,1064,111,Marge,Simpson,marge.simpson@springfield.com,1956-03-19
1,2027,222,Homer,Simpson,homer.simpson@springfield.com,1956-05-12
2,4242,444,Lisa,Simpson,lisa.simpson@springfield.com,1982-05-09
3,5432,555,Maggie,Simpson,maggie.simpson@springfield.com,1989-01-14
4,3666,333,Bart,Simpson,bart.simpson@springfield.com,1980-02-23

### Use a sqlalchemy connection to create a new schedma in the database

### your own database, create connection, engine

In [13]:
db_secret = {
    'drivername': 'postgresql+psycopg2',
    'host'      : 'mmai5100postgres.canadacentral.cloudapp.azure.com',
    'port'      : '5432',
    'user'      : 'annwang',
    'password'  : '2023!Schulich',
    'database'  : 'annwang_db'
}

In [14]:
db_connection_ulr = sa.engine.URL.create(
    drivername = db_secret['drivername'],
    username = db_secret['user'],
    password = db_secret['password'],
    host = db_secret['host'],
    port = db_secret['port'],
    database = db_secret['database']
)

In [15]:
print(db_connection_ulr)

postgresql+psycopg2://annwang:2023!Schulich@mmai5100postgres.canadacentral.cloudapp.azure.com:5432/annwang_db

In [20]:
engine = sa.create_engine(db_connection_ulr)

## Create schema, no panda

In [22]:
with engine.connect() as connection:
    connection.execute('CREATE SCHEMA IF NOT EXISTS wang')

In [30]:
create_table_query = '''
CREATE TABLE IF NOT EXISTS wang.practice(
    student_id INT, 
    first_name VARCHAR(25),
    last_name VARCHAR(25)
);
'''
with engine.connect() as connection:
    connection.execute('CREATE SCHEMA IF NOT EXISTS wang;')
    connection.execute(create_table_query)

### Insert data in to the database using Pandas

In [25]:
student_data = {
    'student_id' : [1,2,3],
    'first_name' : ['Michael', 'Scottie', 'Dennis'],
    'last_mname' : ['Jordan', 'Pippen', 'Rodman']
}

In [26]:
students = pd.DataFrame(data=student_data)
students

   student_id first_name last_mname
0           1    Michael     Jordan
1           2    Scottie     Pippen
2           3     Dennis     Rodman

In [28]:
students.to_sql(
    name = 'hell',
    schema = 'wang',
    con = engine,
    if_exists = 'replace',
    index = False,
    method = 'multi',
    dtype = {
        'student_id': sa.types.INTEGER,
        'first_name' : sa.types.VARCHAR(25),
        'last_name' : sa.types.VARCHAR(25)
    }
)